In [42]:
import os 
os.chdir('C:\\Users\\Acer\\Downloads')
os.getcwd()

'C:\\Users\\Acer\\Downloads'

In [43]:
import pandas as pd
import numpy as np

In [44]:
data = pd.read_excel(r'C:\\Users\\Acer\\Downloads\New folder\Task Data.xlsx')

In [45]:
data.head()

,Customer ID,Name & Surname,Birth Date,Sold date,Unit,Unit Price,Annual Income,Gender,City,Location,Comments
0,LL1000,Eunice Bird,1995-08-03,2017-05-27,7,62,6676,m,Barcelona,West,So good
1,LL1001,James Gross,1982-02-12,2015-11-21,17,29,13471,m,Barcelona,West,Confused
2,LL1002,Wilmer Atkinson,1962-01-01,2019-01-13,15,84,8361,f,Brussel,West,It was bad
3,LL1003,Les Pena,1976-04-23,2017-03-26,30,97,16759,f,Stockholm,North,"I did not like it, it was bad"
4,LL1004,Britt Knight,1996-05-16,2015-05-23,6,70,19397,m,Copenhagen,North,That's the thing I want. Very good profuct

In [46]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 11 columns):
Customer ID       2000 non-null object
Name & Surname    2000 non-null object
Birth Date        2000 non-null datetime64[ns]
Sold date         2000 non-null datetime64[ns]
Unit              2000 non-null object
Unit Price        2000 non-null object
Annual Income     2000 non-null object
Gender            2000 non-null object
City              2000 non-null object
Location          1951 non-null object
Comments          2000 non-null object
dtypes: datetime64[ns](2), object(9)
memory usage: 172.0+ KB

In [47]:
numerics = ['Unit','Unit Price','Annual Income']

In [48]:
for i in numerics:
    data[i]= pd.to_numeric(data[i], errors = 'coerce')

### 1

In [49]:
data['Annual Income'].sum()

26784714.0

In [50]:
data['Annual Income'] = data['Annual Income'].fillna(data['Annual Income'].mean())

In [51]:
data['Annual Income'].sum()

26892283.13253012

### 2

In [52]:
data['Age'] = 2019 - data['Birth Date'].dt.year

In [53]:
data['Age'].value_counts().head(3)

60    48
66    48
42    47
Name: Age, dtype: int64

### 3

##### View

In [54]:
data.groupby(['City','Location']).mean()

                          Unit  Unit Price  Annual Income        Age
City       Location
Baku       South     16.415459   55.473684   13655.859162  43.047393
Barcelona  West      17.181818   56.971292   13598.861244  43.377990
Berlin     Center    17.061404   55.725664   13945.144737  44.250000
Brussel    West      17.051643   53.333333   13183.216276  40.841121
Bucharest  East      18.504587   58.129630   13757.348624  41.032110
Copenhagen North     17.865613   51.844622   13599.902132  43.082677
Istanbul   South     17.371429   57.156398   13249.179913  42.754717
Stockholm  North     17.707547   58.000000   12658.307272  43.396226
Vienna     Center    18.720207   54.789474   13498.337521  43.217617

In [55]:
data.groupby(['City','Location']).mean().index

MultiIndex(levels=[['Baku', 'Barcelona', 'Berlin', 'Brussel', 'Bucharest', 'Copenhagen', 'Istanbul', 'Stockholm', 'Vienna'], ['Center', 'East', 'North', 'South', 'West']],
           codes=[[0, 1, 2, 3, 4, 5, 6, 7, 8], [3, 4, 0, 4, 1, 2, 3, 2, 0]],
           names=['City', 'Location'])

In [56]:
indexes = data.groupby(['City','Location']).mean().index

In [57]:
indexes[2][0]

'Berlin'

In [58]:
indexes[2][1]

'Center'

In [59]:
for i in range(0,len(indexes)):
    data.loc[data['City'] == indexes[i][0], 'Location']  = indexes[i][1]

In [60]:
data.head()

,Customer ID,Name & Surname,Birth Date,Sold date,Unit,Unit Price,Annual Income,Gender,City,Location,Comments,Age
0,LL1000,Eunice Bird,1995-08-03,2017-05-27,7.0,62.0,6676.0,m,Barcelona,West,So good,24
1,LL1001,James Gross,1982-02-12,2015-11-21,17.0,29.0,13471.0,m,Barcelona,West,Confused,37
2,LL1002,Wilmer Atkinson,1962-01-01,2019-01-13,15.0,84.0,8361.0,f,Brussel,West,It was bad,57
3,LL1003,Les Pena,1976-04-23,2017-03-26,30.0,97.0,16759.0,f,Stockholm,North,"I did not like it, it was bad",43
4,LL1004,Britt Knight,1996-05-16,2015-05-23,6.0,70.0,19397.0,m,Copenhagen,North,That's the thing I want. Very good profuct,23

---

### 4

In [61]:
data['Comments'] = data['Comments'].str.lower()

In [62]:
data['Rates'] = np.where(data['Comments'].str.contains('good') | data['Comments'].str.contains('high'),'Liked',
         np.where(data['Comments'].str.contains('bad'),"Didn't liked",'---'))

In [63]:
data.head()

,Customer ID,Name & Surname,Birth Date,Sold date,Unit,Unit Price,Annual Income,Gender,City,Location,Comments,Age,Rates
0,LL1000,Eunice Bird,1995-08-03,2017-05-27,7.0,62.0,6676.0,m,Barcelona,West,so good,24,Liked
1,LL1001,James Gross,1982-02-12,2015-11-21,17.0,29.0,13471.0,m,Barcelona,West,confused,37,---
2,LL1002,Wilmer Atkinson,1962-01-01,2019-01-13,15.0,84.0,8361.0,f,Brussel,West,it was bad,57,Didn't liked
3,LL1003,Les Pena,1976-04-23,2017-03-26,30.0,97.0,16759.0,f,Stockholm,North,"i did not like it, it was bad",43,Didn't liked
4,LL1004,Britt Knight,1996-05-16,2015-05-23,6.0,70.0,19397.0,m,Copenhagen,North,that's the thing i want. very good profuct,23,Liked

### 5

In [64]:
data['Sold Year'] = data['Sold date'].dt.year

In [65]:
data[data['Sold Year'] == 2018]['Unit'].sum()

6363.0

In [66]:
data.groupby('Sold Year').sum()

             Unit  Unit Price  Annual Income    Age
Sold Year
2015       7365.0     22500.0   5.380204e+06  17536
2016       6746.0     21218.0   5.368903e+06  16419
2017       7631.0     24529.0   5.871986e+06  18428
2018       6363.0     20172.0   4.848226e+06  15248
2019       6806.0     22003.0   5.422963e+06  18054

### 6

In [67]:
data['Total Sales'] = data['Unit'] * data['Unit Price']

In [68]:
data[data['Sold Year'] == 2016]['Total Sales'].sum()

364807.0

### 7

In [69]:
data.groupby('Sold Year').sum()[['Total Sales']].loc[2019]

Total Sales    374461.0
Name: 2019, dtype: float64

In [70]:
data.groupby('Sold Year').sum()[['Total Sales']].loc[2015]

Total Sales    399869.0
Name: 2015, dtype: float64

In [71]:
data.groupby('Sold Year').sum()[['Total Sales']].loc[2015] - data.groupby('Sold Year').sum()[['Total Sales']].loc[2019]

Total Sales    25408.0
dtype: float64

----

### 8

In [72]:
data.describe()

,Unit,Unit Price,Annual Income,Age,Sold Year,Total Sales
count,1992.000000,1985.000000,2000.000000,2000.00000,2000.000000,1977.000000
mean,17.525602,55.628212,13446.141566,42.84250,2016.972000,969.062215
std,9.209834,26.440568,6524.094649,15.45811,1.413228,720.005898
min,2.000000,10.000000,2505.000000,0.00000,2015.000000,20.000000
25%,10.000000,33.000000,7836.500000,30.00000,2016.000000,384.000000
50%,17.000000,56.000000,13334.500000,43.00000,2017.000000,780.000000
75%,26.000000,78.000000,19170.750000,56.00000,2018.000000,1416.000000
max,33.000000,100.000000,24992.000000,69.00000,2019.000000,3104.000000

In [73]:
data.loc[data['Age'] < 15,'Age'] = data[data['Age']>15]['Age'].mean()

-----

### 9

In [74]:
data['Month_name'] = data['Birth Date'].dt.month_name()

In [75]:
data[data['Annual Income'] > 20000]['Month_name'].value_counts()

December     44
July         42
January      42
August       38
March        36
April        35
November     34
September    32
June         30
May          30
October      29
February     24
Name: Month_name, dtype: int64

### 10

In [76]:
data[data['Rates'] == "Didn't liked"]['Location'].value_counts()

North     215
Center    201
West      194
South     183
East       95
Name: Location, dtype: int64

### 11

In [77]:
data[data['City'] == 'Barcelona'].groupby('Gender').sum()

          Unit  Unit Price  Annual Income          Age  Sold Year  Total Sales
Gender
f       2037.0      6531.0      1526294.0  5244.932798     233988     113351.0
m       1729.0      5857.0      1419100.0  4369.000000     207756      97187.0

### 12

In [78]:
a  = data[data['Rates'] == 'Liked']['Annual Income'].mean()

In [79]:
b = data[data['Rates'] == "Didn't liked"]['Annual Income'].mean()

In [80]:
a - b

-280.24916790067255

### 13

In [81]:
data.groupby(['Gender','Sold Year']).sum()[['Total Sales']]

                  Total Sales
Gender Sold Year
f      2015          215778.0
       2016          167215.0
       2017          218773.0
       2018          174681.0
       2019          176204.0
m      2015          184091.0
       2016          197592.0
       2017          208124.0
       2018          175121.0
       2019          198257.0

### 14

In [82]:
data.groupby(['Location','City']).sum()[['Total Sales']]

                     Total Sales
Location City
Center   Berlin         214722.0
         Vienna         202648.0
East     Bucharest      233287.0
North    Copenhagen     235463.0
         Stockholm      217493.0
South    Baku           186004.0
         Istanbul       210819.0
West     Barcelona      210538.0
         Brussel        204862.0